Tekla.Structures.Model.BaseComponent
The BaseComponent class is an abstract base class that represents generic components. The generic components
derived from the base component are the component, the connection, the detail and the seam.

Tekla.Structures.Model.BaseComponent.CUSTOM_OBJECT_NUMBER
The component number to be used when calling a custom component.

Tekla.Structures.Model.BaseComponent.PLUGIN_OBJECT_NUMBER
The component number to be used when calling a plug-in or a type derived from the connection base.

Tekla.Structures.Model.BaseComponent.ConnectionCodeFromAttributeFile
A constant string defining that the connection code is to be read from the attribute file. The
connection code must be set to this constant value before inserting the component.

Tekla.Structures.Model.BaseComponent.ClassFromAttributeFile
A constant integer defining that the class is to be read from the attribute file. The
class must be set to this constant value before inserting the component.

Tekla.Structures.Model.BaseComponent.Name
The name of the component. The name identifies custom components or plug-ins.

Tekla.Structures.Model.BaseComponent.Number
The number of the component. A number greater than zero identifies system components,
for custom components the number is CUSTOM_OBJECT_NUMBER, and for plug-ins the number is PLUGIN_OBJECT_NUMBER.

Tekla.Structures.Model.BaseComponent.PrimaryObject
The primary object of the detail, seam and connection.

Tekla.Structures.Model.BaseComponent.SecondaryObjects
The secondary objects for the detail, seam and connection.

Tekla.Structures.Model.BaseComponent._InputPolygon
Contains the reference point for the detail or the input polygon
for the seam.

Tekla.Structures.Model.BaseComponent._Attributes
Stores all the attributes that the user has set.

Tekla.Structures.Model.BaseComponent.#ctor
Creates a base component instance with default attributes.

Tekla.Structures.Model.BaseComponent.SetAttribute(System.String,System.String)
Sets the attribute's value to the given value.
AttrName: The name of the attribute.
StrValue: The string value of the attribute.

Tekla.Structures.Model.BaseComponent.SetAttribute(System.String,System.Int32)
Sets the attribute's value to the given value.
AttrName: The name of the attribute.
Value: The integer value of the attribute.

Tekla.Structures.Model.BaseComponent.SetAttribute(System.String,System.Double)
Sets the attribute's value to the given value.
AttrName: The name of the attribute.
DValue: The double value of the attribute.

Tekla.Structures.Model.BaseComponent.GetAttribute(System.String,System.String@)
Retrieves the attribute with the given name.
AttrName: The name of the attribute.
StrValue: A string for the return value.
Returns: True if successful.

Tekla.Structures.Model.BaseComponent.GetAttribute(System.String,System.Int32@)
Retrieves the attribute with the given name.
AttrName: The name of the attribute.
Value: An integer for the return value.
Returns: True if successful.

Tekla.Structures.Model.BaseComponent.GetAttribute(System.String,System.Double@)
Retrieves the attribute with the given name.
AttrName: The name of the attribute.
DValue: A double for the return value.
Returns: True if successful.

Tekla.Structures.Model.BaseComponent.AddAttributesToStack
Adds all the attributes to the stack in Tekla Structures, one attribute is added at a time.
Returns: True if no errors occured while adding the attributes.

Tekla.Structures.Model.BaseComponent.LoadAttributesFromFile(System.String)
Loads the attributes for the component from the given file. These attributes
will be loaded before all the attributes that have been set with the SetAttribute
methods, so any attributes that are set with SetAttribute will override those
loaded from the given standard file.
Filename: The name of the file.
Returns: True if a file name is specified.

Tekla.Structures.Model.BaseComponent.LoadComponentAttributes
Loads the component attributes to the stack. This needs to be run before
the attributes the user sets are added to the stack.
Returns: True if the file name was set and the attributes were correctly loaded.

Tekla.Structures.Model.BaseComponent.InputPolygon
An input polygon for the seam and the custom part.